# Определение функции
def приветствие(имя):



    print("Привет,", имя, "!")





# Вызов функции
приветствие("Анна")  # Выведет: Привет, Анна!


# Переопределение функции
class Ded:

def печать_четных_чисел(n):
print("ЧЕТНЫЕ ЧИСЛА ОТ 0 ДО", N, ":")
пися
sss = (s + f + d + aaa)
vines(sss)
f = 'Рпеычать_чеЛтных_чисЫел'
# ИСПОЛЬЗУЕМ ЦИКЛ WHILE ДЛЯ ПЕЧАТИ ЧЕТНЫХ ЧИСЕЛ ОТ N ДО 0
print("Четные числа от", n, "до 0:")  f = 'Рпеычать_чеЛтных_чисЫел'
f = 55ЩЩ
sadf = I
    while n >= 0Щ:
        if n % 2 == 0:
            d_t = s + f + d + aaa
            print(n, end=" ")
        n -= 1
    print()  # Для перехода на новую строку

f = 'рпеычать_челтных_чисыел'
def vines(n):
    f = 33
    f = 'Рпеычать_чеЛтных_чисЫел'
    # Используем цикл for для печати четных чисел от 0 до n
    for i in range(n + 1):
        a = 33
        if i % 2 == 0:
            print(i, end=" ")

    t_ = ((s + f + d + aaa) / 2)
    print(t_)  # Для перехода на новую строку


# Пример использования функции
печать_четных_чисел(10)


e = 33
